#  Pandas

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

* pandas contains data structures and data manipulation tools designed to make data cleaning and analysis fast and easy in Python. 

* pandas is often used in tandem with numerical computing tools like NumPy and SciPy, analytical libraries like statsmodels and scikit-learn, and data visualization libraries like matplotlib. 

* pandas adopts significant parts of NumPy’s idiomatic style of array-based computing, especially array-based functions and a preference for data processing without _for_ loops.

* While pandas adopts many coding idioms from NumPy, the biggest difference is that pandas is designed for working with *tabular* or *heterogeneous* data. NumPy, by contrast, is best suited for working with *homogeneous numerical* array data.

## Introduction to pandas Data Structures

## Series

A **Series** is a one-dimensional array-like object containing a sequence of values (of  similar types to NumPy types) and an associated array of data labels, called its _index_. The simplest Series is formed from only an array of data:

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

Since we did not specify an index for the data, a default one consisting of the integers 0 through N - 1 (where N is the length of the data) is created. You can get the array representation and index object of the Series via its **values** and **index** attributes, respectively:

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

Often it will be desirable to create a Series with an **index** identifying each data point with a label:

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

You can use labels in the index when selecting single values or a set of values:

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6

In [11]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

Using NumPy functions or NumPy-like operations, such as filtering with a boolean array, scalar multiplication, or applying math functions, will preserve the index-value link:

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about a Series is as a fixed-length, *ordered dict*, as it is a mapping of index values to data values. It can be used in many contexts where you might use a **dict**:

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

You can create a Series from it by passing the dict:

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

When you are only passing a *dict*, the index in the resulting Series will have the _dict’s keys in sorted order_. You can override this by passing the dict keys in the order you want them to appear in the resulting Series:

In [28]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [29]:
obj4 = pd.Series(sdata, index=states)

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

The **isnull** and **notnull** functions in pandas should be used to detect missing data:

In [31]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

Series also has these as instance methods:

In [34]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [35]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

A useful Series feature for many applications is that it _automatically aligns by index label_ in arithmetic operations:

In [36]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [37]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [38]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both the *Series object itself* and its *index* have a **name** attribute, which integrates with other key areas of pandas functionality:

In [39]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [40]:
obj4.name = 'population'

In [41]:
obj4.index.name = 'state'

In [42]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A Series’s index can be altered in-place by assignment:

In [43]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [44]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [45]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

* A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string,  boolean, etc.). 

* The DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing the same index. 

* The data is stored as one or more two-dimensional blocks rather than a list, dict, or some other collection of one-dimensional arrays. 

* While a DataFrame is physically two-dimensional, you can use it to represent higher dimensional data in a tabular format using hierarchical indexing.

There are many ways to construct a DataFrame, though one of the most common is from a dict of equal-length lists or NumPy arrays:

In [47]:
data = {'state':
        ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [48]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

For large DataFrames, the **head** method selects only the first five rows:

In [49]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [50]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

If you specify a sequence of **columns**, the DataFrame’s columns will be arranged in that order:

In [51]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

If you pass a column that isn’t contained in the dict, it will appear with missing values in the result:

In [52]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [53]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
index=['one', 'two', 'three', 'four','five', 'six'])

In [54]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

A column in a DataFrame can be retrieved _as a Series_ either by _dict-like_ notation or by _attribute_:

In [55]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [56]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

Note that the returned Series have the _same index_ as the DataFrame, and their name attribute has been appropriately set.

**The column returned from indexing a DataFrame is a view on the underlying data, not a copy. Thus, any in-place modifications to the Series will be reflected in the DataFrame. The column can be explicitly copied with the Series’s _copy_ method.**

Rows can also be retrieved by position or name with the special **.loc** attribute:

In [58]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment. For example, the empty 'debt' column  could be assigned a scalar value or an array of values:

In [59]:
frame2['debt'] = 16.5

In [60]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [61]:
frame2['debt'] = np.arange(6.)

In [62]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any holes:

In [63]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [64]:
frame2['debt'] = val

In [65]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

Assigning a column that doesn’t exist will create a new column. The **del** keyword will delete columns as with a dict.

In [67]:
frame2['eastern'] = (frame2.state == 'Ohio')

In [68]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [69]:
del frame2['eastern']

In [70]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [71]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

**New columns cannot be created with the frame2.eastern syntax.**

Another common form of data is a nested dict of dicts:

In [72]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

pandas will interpret the *outer dict* keys as the *columns* and the *inner keys* as the row indices:

In [73]:
frame3 = pd.DataFrame(pop)

In [74]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array:

In [75]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

The keys in the inner dicts are combined and sorted to form the index in the result. This isn’t true if an explicit index is specified:

In [76]:
##pop = {'Nevada': {2001: 2.4, 2002: 2.9},        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [77]:
## pd.DataFrame(pop, index=['a', 'b'])

Dicts of Series are treated in much the same way:

In [78]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}

In [79]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

![alt text](images/constructors.png "Possible data inputs to DataFrame constructor")

If a DataFrame’s index and columns have their *name* attributes set, these will also be displayed:

In [80]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [81]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

As with Series, the **values** attribute returns the data contained in the DataFrame as a two-dimensional ndarray:

In [82]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

If the DataFrame’s columns are different dtypes, the dtype of the values array will be chosen to accommodate all of the columns:

In [83]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

pandas’s *Index* objects are responsible for holding the axis labels and other metadata (like the axis name or names). Any array or other sequence of labels you use when  constructing a Series or DataFrame is internally converted to an Index:

In [84]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [85]:
obj

a    0
b    1
c    2
dtype: int64

In [86]:
index = obj.index

In [87]:
index

Index(['a', 'b', 'c'], dtype='object')

In [88]:
index[1:]

Index(['b', 'c'], dtype='object')

Index objects are immutable and thus can’t be modified by the user:

Immutability makes it safer to share Index objects among data structures:

In [89]:
labels = pd.Index(np.arange(3))

In [90]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [91]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [92]:
obj2.index is labels

True

In addition to being array-like, an Index also behaves like a fixed-size set:

In [93]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [94]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [95]:
'Ohio' in frame3.columns

True

Unlike Python sets, a pandas Index can contain duplicate labels:

In [96]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [97]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

Selections with duplicate labels will select all occurrences of that label.

Each Index has a number of methods and properties for set logic, which answer other common questions about the data it contains.

![alt text](images/Index.png "Some Index methods and properties")

## Essential Functionality

### Reindexing

An important method on pandas objects is **reindex**, which means to create a new object with the data conformed to a new index. Consider an example:

In [100]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [101]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Calling **reindex** on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present:

In [102]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [103]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or fill‐ ing of values when reindexing. The method option allows us to do this, using a method such as **ffill**, which forward-fills the values:

In [104]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [105]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [106]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When passed only a sequence, it reindexes the rows in the result:

In [107]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
index=['a', 'c', 'd'],
columns=['Ohio', 'Texas', 'California'])

In [108]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [109]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [110]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

The columns can be reindexed with the **columns** keyword:

In [111]:
states = ['Texas', 'Utah', 'California']

In [112]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

You can reindex more succinctly by label-indexing  with loc, and many users prefer to use it exclusively:

In [113]:
frame.loc[['a', 'b', 'c', 'd'], states]

D:\Anaconda3\envs\cv_course\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

![alt text](images/reindex.png "reindex function arguments")

### Dropping Entries from an Axis

**drop** method will return a new object with the indicated value or values deleted from an axis:

In [114]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [115]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [116]:
new_obj = obj.drop('c')

In [117]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [118]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis. To illustrate this, we first create an example DataFrame:

In [119]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [120]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [121]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

You can drop values from the columns by passing _axis=1_ or _axis='columns'_:

In [122]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [123]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

Many functions, like drop, which modify the size or shape of a Series or DataFrame, can manipulate an object **in-place** without returning a new object:

In [124]:
obj.drop('c', inplace=True)

In [125]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and  Filtering

Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Series’s index values instead of only integers. Here are some examples of this:

In [126]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [127]:
obj['b']

1.0

In [128]:
obj[1]

1.0

In [129]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [131]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [132]:
obj.loc[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [133]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [134]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the endpoint is **inclusive**:

In [135]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [136]:
obj['b':'c'] = 5

In [137]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequence:

In [138]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [139]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [140]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [142]:
data.loc['Colorado', 'two']

5

In [143]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

Indexing like this has a few special cases. First, slicing or selecting data with a boolean array:

In [144]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [145]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The row selection syntax data[:2] is provided as a convenience. Passing a single element or a list to the [] operator selects **columns*.

Another use case is in indexing with a boolean DataFrame, such as one produced by a scalar comparison:

In [146]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [147]:
data[data < 5] = 0

In [148]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

**loc** and **iloc** enable you to select a subset of the rows and columns from a DataFrame with NumPy-like notation using either axis labels (loc) or integers (iloc).

In [149]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [150]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [151]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [152]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Both indexing functions work with slices in addition to single labels or lists of labels:

In [153]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [154]:
data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [155]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

![alt text](images/indexingoptions.png "Indexing options with DataFrame")

### Integer Indexes

Working with pandas objects indexed by integers is something that often trips up  new users due to some differences with indexing semantics on built-in Python data structures like lists and tuples. For example, you might not expect the following code to generate an error:

In [156]:
ser = pd.Series(np.arange(3.))

In [157]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [163]:
#ser[-1] error

In [164]:
ser.iloc[-1]

2.0

On the other hand, with a non-integer index, there is no potential for ambiguity:

In [168]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [169]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [170]:
ser2[-1]

2.0

To keep things consistent, if you have an axis index containing integers, data selection will always be label-oriented. For more precise handling, use loc (for labels) or iloc (for integers):

In [172]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [171]:
ser[:1]

0    0.0
dtype: float64

In [173]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [174]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

An important pandas feature for some applications is the behavior of arithmetic between objects with different indexes. When you are adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs. For users with database experience, this is similar to an automatic outer join on the index labels. Let’s look at an example:

In [175]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [176]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [177]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [178]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [179]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In the case of DataFrame, alignment is performed on both the rows and the columns:

In [180]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list(
    'bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list(
    'bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [181]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [182]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [183]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### Arithmetic methods with fill values

In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other:

In [184]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [185]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [186]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [187]:
df2.loc[1, 'b'] = np.nan

In [188]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [189]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the **add** method on df1, I pass df2 and an argument to **fill_value**:

In [190]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

See Table 5-5 for a listing of Series and DataFrame methods for arithmetic. Each of them has a counterpart, starting with the letter *r*, that has arguments flipped. So these two statements are equivalent:

In [191]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [192]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

![alt text](images/arithmetic.png "Flexible arithmetic methods")

Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill value:

In [193]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [194]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [195]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

In [196]:
arr = np.arange(12.).reshape((3, 4))

In [197]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [199]:
arr[0]

array([0., 1., 2., 3.])

In [200]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [203]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [204]:
series = frame.iloc[0]

In [205]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [206]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [207]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an index value is not found in either the DataFrame’s columns or the Series’s index, the objects will be reindexed to form the union:

In [215]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [216]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [217]:
series2

b    0
e    1
f    2
dtype: int64

In [218]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to use one of the arithmetic methods. For example:

In [219]:
series3 = frame['d']

In [220]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [221]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [185]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [222]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [223]:
frame

               b         d         e
Utah    0.130469  1.041959  0.049185
Ohio   -0.878872  1.543742  0.395307
Texas  -0.118364 -0.494453 -1.774872
Oregon  1.365341  1.612299 -0.622160

In [224]:
np.abs(frame)

               b         d         e
Utah    0.130469  1.041959  0.049185
Ohio    0.878872  1.543742  0.395307
Texas   0.118364  0.494453  1.774872
Oregon  1.365341  1.612299  0.622160

Another frequent operation is applying a function on one-dimensional arrays to each column or row. DataFrame’s **apply** method does exactly this:

In [226]:
frame

               b         d         e
Utah    0.130469  1.041959  0.049185
Ohio   -0.878872  1.543742  0.395307
Texas  -0.118364 -0.494453 -1.774872
Oregon  1.365341  1.612299 -0.622160

In [231]:
f = lambda x: x.max() - x.min()

In [233]:
frame.apply(f)

b    2.244214
d    2.106752
e    2.170180
dtype: float64

Here the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame. The result is a Series having the columns of frame as its index.

If you pass _axis='columns'_ to apply, the function will be invoked once per row instead:

In [234]:
frame.apply(f, axis='columns')

Utah      0.992775
Ohio      2.422615
Texas     1.656508
Oregon    2.234459
dtype: float64

Many of the most common array statistics (like **sum** and **mean**) are DataFrame methods, so using apply is not necessary.

The function passed to apply need not return a scalar value; it can also return a Series with multiple values:

In [235]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [237]:
frame.apply(f)

            b         d         e
min -0.878872 -0.494453 -1.774872
max  1.365341  1.612299  0.395307

In [239]:
frame.apply(f, axis=1)

             min       max
Utah    0.049185  1.041959
Ohio   -0.878872  1.543742
Texas  -1.774872 -0.118364
Oregon -0.622160  1.612299

Element-wise Python functions can be used, too. Suppose you wanted to compute a formatted string from each floating-point value in frame. You can do this with **applymap**:

In [242]:
format = lambda x: '%.2f' % x

In [243]:
frame.applymap(lambda x:2*x)

               b         d         e
Utah    0.260939  2.083919  0.098370
Ohio   -1.757745  3.087484  0.790615
Texas  -0.236729 -0.988906 -3.549744
Oregon  2.730683  3.224598 -1.244320

In [244]:
frame.applymap(format)

            b      d      e
Utah     0.13   1.04   0.05
Ohio    -0.88   1.54   0.40
Texas   -0.12  -0.49  -1.77
Oregon   1.37   1.61  -0.62

The reason for the name **applymap** is that Series has a **map** method for applying an element-wise function:

In [196]:
frame['e'].map(format)

Utah       1.34
Ohio       1.40
Texas     -0.28
Oregon     0.12
Name: e, dtype: object

## Sorting and Ranking

To sort lexicographically by row or column index, use the _sort_index_ method, which returns a new, sorted object:

In [245]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [246]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [248]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [251]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [252]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [253]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [254]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [255]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its **sort_values** method:

In [256]:
obj = pd.Series([4, 7, -3, 2])

In [257]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [258]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [259]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort keys. To do so, pass one or more column names to the **by** option of **sort_values**:

In [260]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [261]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [262]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [263]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [264]:
frame.sort_values(by=['b', 'a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array. The **rank** methods for Series and DataFrame are the place to look; by default rank breaks ties by assigning each group the mean rank (Equal values are assigned a rank that is the average of the ranks of those values):

In [265]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [266]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the data:

In [267]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have been set to 6 and 7 because label 0 precedes label 2 in the data.

In [268]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

![alt text](images/rank.png "Tie-breaking methods with rank")

DataFrame can compute ranks over the rows or the columns:

In [270]:
frame = pd.DataFrame(
    {'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [271]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [272]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [273]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

While many pandas functions (like reindex) require that the labels be unique, it’s not mandatory. Let’s consider a small Series with duplicate indices:

In [274]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [275]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index’s **is_unique** property can tell you whether its labels are unique or not:

In [276]:
obj.index.is_unique

False

Data selection is one of the main things that behaves differently with duplicates. Indexing a label with multiple entries returns a Series, while single entries return a  scalar value:

In [277]:
obj['a']

a    0
a    1
dtype: int64

In [278]:
obj['c']

4

The same logic extends to indexing rows in a DataFrame:

In [279]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [280]:
df

          0         1         2
a -0.468872 -1.304699 -0.586563
a  2.493526  0.505584  0.548233
b  0.200488 -2.075371 -0.438623
b  0.376705 -0.886022 -1.892551

In [281]:
df.loc['b']

          0         1         2
b  0.200488 -2.075371 -0.438623
b  0.376705 -0.886022 -1.892551

## Summarizing and Computing Descriptive Statistics

In [282]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [283]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calling DataFrame’s sum method returns a Series containing column sums:

In [284]:
df.sum()

one    9.25
two   -5.80
dtype: float64

Passing __axis='columns'__ or __axis=1__ sums across the columns instead:

In [285]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are excluded unless the entire slice (row or column in this case) is NA. This can be disabled with the **skipna** option:

In [287]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

List of common options for each reduction method:

* axis:	Axis to reduce over; 0 for DataFrame’s rows and 1 for columns
* skipna: Exclude missing values; True by  default
* level:	Reduce grouped by level if the axis is hierarchically indexed  (MultiIndex)

Some methods, like **idxmin** and **idxmax**, return indirect statistics like the index value where the minimum or maximum values are attained:

In [288]:
df.idxmax()

one    b
two    d
dtype: object

In [289]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

Other methods are accumulations:

In [290]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Another type of method is neither a reduction nor an accumulation. describe is one such example, producing multiple summary statistics in one shot:

In [291]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

On non-numeric data, **describe** produces alternative summary statistics:

In [292]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [293]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

![alt text](images/summary.png "Descriptive and summary statistics")

### Unique Values, Value Counts, and Membership

**unique** which gives you an array of the unique values in a Series:

In [294]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [295]:
uniques = obj.unique()

In [296]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

**value_counts** computes a Series containing value frequencies:

In [297]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

**value_counts** is also available as a top-level pandas method that can be used with any array or sequence:

In [298]:
pd.value_counts(obj.values, sort=False)

c    3
d    1
b    2
a    3
dtype: int64

**isin** performs a vectorized set membership check and can be useful in filtering a dataset down to a subset of values in a Series or column in a DataFrame:

In [299]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [300]:
mask = obj.isin(['b', 'c'])

In [301]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [302]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

Related to **isin** is the **Index.get_indexer** method, which gives you an index array from an array of possibly non-distinct values into another array of distinct values:

In [303]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [304]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [305]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

![alt text](images/unique.png "Unique, value counts, and set membership methods")

In some cases, you may want to compute a histogram on multiple related columns in a DataFrame. Here’s an example:

In [306]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

In [309]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

Passing *pandas.value_counts* to this DataFrame’s *apply* function gives:

In [310]:
result = data.apply(pd.value_counts).fillna(0)

In [311]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

Here, the row labels in the result are the distinct values occurring in all of the col‐ umns. The values are the respective counts of these values in each column.